app/Controllers/User.php

    public function act_sign(){
        $data = [];

        if ($this->request->getMethod() === 'post') {
            // Lưu thông tin người dùng vào cơ sở dữ liệu
            $userModel = new UserModel();
            $validationRules = [
                'username' => 'required|max_length[255]|min_length[3]',
                'password' => 'required|max_length[255]|min_length[3]',
                'password_confirm' => 'required|matches[password]',
                'email' => 'required|valid_email',
            ];

            if ($this->validate($validationRules)) {
                // Lấy dữ liệu từ form
                $username = $this->request->getPost('username');
                $password = $this->request->getPost('password');
                $email = $this->request->getPost('email');

                if ($userModel->isUsernameExists($username)) {

                    return redirect()->to(base_url('/signup'))->withInput()->with('error', 'Username đã tồn tại');
                }

                if ($userModel->isEmailExists($email)) {
                    return redirect()->to(base_url('/signup'))->withInput()->with('error', 'Email đã tồn tại');
                }
                // Mã hóa mật khẩu (thường nên sử dụng bcrypt thay vì md5)
                $hashedPassword = md5($password);
                $userModel->save([
                    'username' => $username,
                    'password' => $hashedPassword,
                    'email' =>$email,
                ]);
---
INSERT INTO `users` (`username`, `password`, `email`) VALUES ('HungNgo123', 'e10adc3949ba59abbe56e057f20f883e', 'ngotanhung020119@gmail.com')