app/Models/CategoriesModel.php

SELECT *
FROM `categories`
---
    public function getCategories($name = false)
    {
        if ($name === false) {
            return $this->findAll();