app/Models/ProductsModel.php

SELECT *
FROM `products`
---
    public function getProducts($name = false)
    {
        if ($name === false) {
            return $this->findAll();