app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'HungNgo123'
AND `password` = 'e10adc3949ba59abbe56e057f20f883e'
 LIMIT 1
---
    public function checkUser($username,$password)
    {
        return $this->where(['username' => $username])->where(['password' => $password])->first();

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `username` = 'HungNgo123'
---
    public function isUsernameExists($username)
    {
        return $this->where('username', $username)->countAllResults() > 0;

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `email` = 'ngotanhung020119@gmail.com'
---
    public function isEmailExists($email)
    {
        return $this->where('email', $email)->countAllResults() > 0;